app/controllers/users_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 0 LIMIT 1
---
  def show
  	if user_signed_in?
  		@user = User.find(params[:id])